Enums/Renault_ТООшибкиОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТООшибкиОбщие</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗагрузкиДрайвера</Name>
					<Comment>Необходимо проверить корректность установки драйвера.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗагрузкиОбработкиОбслуживания</Name>
					<Comment>Проверьте корректность указания обработки обслуживания и наличие свободного места на жёстком диске компьютера.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНеизвестно</Name>
					<Comment>Была обнаружена ошибка, обработка которой не предусмотрена.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНетПрав</Name>
					<Comment>Необходимо обратиться к администратору информационной базы.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПараметровНастройки</Name>
					<Comment>Для корректной работы устройства необходимо задать параметры его работы. Сделать это можно при помощи обработки "Настройка торгового оборудования".</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПриПодключении</Name>
					<Comment>Необходимо убедиться, что устройство правильно настроено и соответствующий порт не занят другим приложением.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаТестНеПройден</Name>
					<Comment>Автоматический тест устройства не пройден.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ВидыТорговогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ВидыТорговогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихКода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговаяСистема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_ОбработкиОбслуживанияТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ОбработкиОбслуживанияТО</Name>
			<Comment>Данный справочник содержит обработки обслуживания торгового оборудования.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Реквизит содержит описание обработки обслуживания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид торгового оборудования, обслуживаемый настоящей обработкой обслуживания.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыТорговогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла обработки обслуживания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Comment>Обработка обслуживания торгового оборудования.</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия обработки обслуживания.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор обработки обслуживания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Comment>Версия API механизма торгового, поддерживаемого обработкой обслуживания.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
					<Comment>Модели торгового оборудования, поддерживаемые данной обработкой обслуживания.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель торгового оборудования.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Renault_РаботаСТО/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////

// ФУНКЦИИ РАБОТЫ СО ШТРИХКОДАМИ

// Функция осуществляет ввод штрихкода пользователем.
//
// Возвращаемое значение:
//  Строка - введенный штрихкод. Если пользователь отказался от ввода - возвращается пустая строка.
//
Функция ВвестиШтрихкод() Экспорт
	
	Результат = "";
	
	ВвестиСтроку(Результат, "Введите штрихкод");
	
	Возврат Результат;
	
КонецФункции // ВвестиШтрихкод()

// Функция возвращает результат проверки строки на предмет соответствия
// штрихкоду формата EAN8.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Проверяемый штрихкод.
//
// Возвращаемое значение:
//  <Булево> - Результат проверки.
//
Функция ТипШтрихкодаEAN8ТО(Штрихкод) Экспорт
	
	Результат   = Ложь;
	Сумма       = 0;
	Коэффициент = 3;
	
	Если СтрДлина(Штрихкод) = 8 Тогда
		Индекс = Неопределено;
		Для Индекс = 1 По 7 Цикл
			КодСимв = КодСимвола(Штрихкод, Индекс);
			Если КодСимв < 48 ИЛИ КодСимв > 57 Тогда
				Возврат Результат;
			КонецЕсли;
			Сумма       = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма     = (10 - Сумма % 10) % 10;
		Результат = (КодСимвола(Штрихкод, 8) = Сумма + 48);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ТипШтрихкодаEAN8ТО()

// Функция возвращает результат проверки строки на предмет соответствия
// штрихкоду формата EAN13.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Проверяемый штрихкод.
//
// Возвращаемое значение:
//  <Булево> - Результат проверки.
//
Функция ТипШтрихкодаEAN13ТО(Штрихкод) Экспорт
	
	Результат = (СтрДлина(Штрихкод) = 13
	И КонтрольныйСимволEAN13ТО(Штрихкод) = Прав(Штрихкод, 1));
	
	Возврат Результат;
	
КонецФункции // ТипШтрихкодаEAN13ТО()

// Функция возвращает результат проверки строки на предмет соответствия
// штрихкоду формата ITF14.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Проверяемый штрихкод.
//
// Возвращаемое значение:
//  <Булево> - Результат проверки.
//
Функция ТипШтрихкодаITF14ТО(Штрихкод) Экспорт
	
	Результат   = Ложь;
	Сумма       = 0;
	Коэффициент = 1;
	
	Если СтрДлина(Штрихкод) = 14 Тогда
		Индекс = Неопределено;
		Для Индекс = 1 По 13 Цикл
			КодСимв = КодСимвола(Штрихкод, Индекс);
			Если КодСимв < 48 ИЛИ КодСимв > 57 Тогда
				Возврат Результат;
			КонецЕсли;
			Сумма       = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма     = (10 - Сумма % 10) % 10;
		Результат = (КодСимвола(Штрихкод, 14) = Сумма + 48);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ТипШтрихкодаITF14ТО()

// Функция возвращает результат проверки строки на предмет соответствия
// штрихкоду формата CODE39.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Проверяемый штрихкод.
//
// Возвращаемое значение:
//  <Булево> - Результат проверки.
//
Функция ТипШтрихкодаCODE39ТО(Штрихкод) Экспорт
	
	Результат = Ложь;
	Длина     = СтрДлина(Штрихкод);
	Индекс    = Неопределено;
	
	Если Длина > 0 Тогда
		Результат = Истина;
		Для Индекс = 1 По Длина Цикл
			КодСимв = КодСимвола(Штрихкод, Индекс);
			Если (КодСимв <> 32)
				И (КодСимв < 36 ИЛИ КодСимв > 37)
				И (КодСимв <> 43)
				И (КодСимв < 45 ИЛИ КодСимв > 57)
				И (КодСимв < 65 ИЛИ КодСимв > 90) Тогда
				
				Результат = Ложь;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ТипШтрихкодаCODE39ТО()

// Функция вычисляет контрольный символ кода EAN
//
// Параметры:
//  ШтрихКод     - штрихкод (без контрольной цифры)
//  Тип          - тип штрихкода: 13 - EAN13, 8 - EAN8
//
// Возвращаемое значение:
//  Контрольный символ штрихкода
//
Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции // КонтрольныйСимволEAN()

// Функция возвращает контрольный символ штрихкода EAN13.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Неполный штрихкод (12 символов), для которого вычисляется
//             контрольный 13-й символ.
//
// Возвращаемое значение:
//  <Строка> - Контрольный символ EAN13.
//
Функция КонтрольныйСимволEAN13ТО(Штрихкод) Экспорт
	
	Результат   = "";
	Сумма       = 0;
	Коэффициент = 1;
	
	Индекс = Неопределено;
	Для Индекс = 1 По 12 Цикл
		КодСимв     = КодСимвола(Штрихкод, Индекс);
		Сумма       = Сумма + Коэффициент * (КодСимв - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма     = (10 - Сумма % 10) % 10;
	Результат = Символ(Сумма + 48);
	
	Возврат Результат;
	
КонецФункции // КонтрольныйСимволEAN13ТО()


///////////////////////////////////////////////////////////////////////////////
//// ФУНКЦИИ РАБОТЫ С ОБРАБОТКАМИ ОБСЛУЖИВАНИЯ

// Функция возвращает обработку обслуживания торгового оборудования.
//
// Параметры:
//  Модель                             - <СправочникСсылка.ТорговоеОборудование>
//                                     - Модель торгового оборудования, для
//                                       которой необходимо получить обработку
//                                       обслуживания.
//
//  Обработка                          - <ВнешняяОбработкаОбъект.*>
//                                     - Выходной параметр; обработка обслуживания,
//                                       соответствующая указанной модели торгового
//                                       оборудования.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибкиОбщие> - Результат выполнения операции.
//                                       В случае успешного завершения возвращается
//                                       пустая ссылка перечисления ТООшибкиОбщие.
//
Функция ПолучитьОбработкуОбслуживанияТО(Модель, Обработка) Экспорт
	
	Обработка = Неопределено;
	
	Попытка
		ИмяФайла = DMS_ПолучитьИмяФайла(ПолучитьИмяКаталога(), Модель.ОбработкаОбслуживания.ИмяФайла);
		Данные   = Модель.ОбработкаОбслуживания.Обработка;
		
		Данные.Получить().Записать(ИмяФайла);
		
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
	Исключение
		Результат = Перечисления.Renault_ТООшибкиОбщие.ОшибкаЗагрузкиОбработкиОбслуживания;
		Возврат Результат;
	КонецПопытки;
	
	Возврат Перечисления.Renault_ТООшибкиОбщие.ПустаяСсылка();
	
КонецФункции // ПолучитьОбработкуОбслуживанияТО()

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ, ОБЕСПЕЧИВАЮЩИЕ ЭКСПОРТ, ИМПОРТ И ОБНОВЛЕНИЕ ОБРАБОТОК ОБСЛУЖИВАНИЯ

// Функция возвращает информацию о обработках обслуживания, удовлетворяющих,
// если значение параметра "ИспользоватьФильтр" = Истина,
// критериям отбора. Дополнительно можно указать идентификатор.
//
// Параметры
//  Идентификатор      - <Строка>, <Неопределено>
//                     - В случае, если данный параметр имеет значение, отличное от
//                       "Неопределено", будет возвращён единственный элемент
//                       справочника, имеющий данный идентификатор. Если
//                       отбор исключает данное значение, то оно возвращено не будет.
//
//  Версия             - <Число>, <Неопределено>
//                       В случае, если данный параметр имеет значение, отличное от
//                       "Неопределено", элементы, имеющие данную или более позднюю
//                       версии, будут исключены.
//
//  ИспользоватьФильтр - <Булево>
//                     - В случае, если данный параметр имеет значение Истина,
//                       будет использоваться фильтр.
//
// Возвращаемое значение:
//  <ТаблицаЗначений>  - Таблица, содержащая информацию об обработках обслуживания
//
Функция ПолучитьОбработки(ВидТО) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|    СпрОбработки.Код,
	|    СпрОбработки.Наименование,
	|    СпрОбработки.ПометкаУдаления,
	|    СпрОбработки.Ссылка,
	|    СпрОбработки.Описание,
	|    СпрОбработки.Вид,
	|    СпрОбработки.ИмяФайла,
	|    СпрОбработки.Версия,
	|    СпрОбработки.ВерсияAPI,
	|    СпрОбработки.Идентификатор,
	|    СпрОбработки.Обработка
	|ИЗ
	|    Справочник.Renault_ОбработкиОбслуживанияТО КАК СпрОбработки
	|ГДЕ
	|    СпрОбработки.ПометкаУдаления = Ложь
	|    " + ?(ВидТО = Неопределено, "", "И
	|    СпрОбработки.Вид = &ВидТО"));

	Если ВидТО <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидТО", ВидТО);
	КонецЕсли;

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьОбработки()

// Процедура осуществляет импорт обработок обслуживания.
//
// Параметры
//  КонтролироватьВерсии - <Булево>
//                       - В случае, если данный параметр имеет значение "Истина",
//                         будет осуществляться контроль версий обработок
//                         обслуживания.
//
&НаКлиенте
Процедура ИмпортироватьОбработки(ПроцессОбновления, ВидТО = Неопределено) Экспорт

	Индикатор = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог, содержащий обработки обслуживания";
	СписокФайлов = Неопределено;
	СоответствиеИменФайлов = Неопределено;
	ОбновленоЗаписей = 0;
	ДобавленоЗаписей = 0;

	Пока Истина Цикл
		Если НЕ Диалог.Выбрать() Тогда // Выбирается каталог с обработками обслуживания
			Возврат;
		КонецЕсли;
		
		СписокФайлов = НайтиФайлы(Диалог.Каталог, "*.epf"); // Получаем список всех обработок в выбранном каталоге

		// Если не обнаружено ни одной обработки...
		Если СписокФайлов.Количество() = 0 Тогда
			Ответ = Вопрос("В указанном каталоге не обнаружены обработки обслуживания." + Символы.ПС + "Выбрать другой каталог?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// Если не обнаружено ни одной обработки, то завершаем импорт
	Если СписокФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЭлементыСправочника = ПолучитьОбработки(ВидТО); // Получаем из справочника "ОбработкиОбслуживанияТО" уже загруженные обработки
	ПолноеИмяФайла = DMS_ПолучитьИмяФайла(Диалог.Каталог, "\temp.epf"); // Временный файл для работы с ОО из справочника
	СоответствиеИмен = Новый Соответствие;

	// Индикатор хода работы с ОО справочника
	Индикатор.НаименованиеОбработкиДанных = "Обработка справочника обработок обслуживания";
	Индикатор.КомментарийОбработкиДанных  = "";
	Индикатор.КомментарийЗначения         = "Обработано";
	Индикатор.МаксимальноеЗначение        = ЭлементыСправочника.Количество();
	Индикатор.Значение = 0;
	Если Индикатор.МаксимальноеЗначение > 0 Тогда
		Индикатор.Открыть();
	КонецЕсли;

	// Сначала выполняем обход справочника
	ОбрОбслуживания = Неопределено;
	Для Каждого ЭлементСправочника Из ЭлементыСправочника Цикл
		Индикатор.КомментарийОбработкиДанных = "Обработка элемента: " + ЭлементСправочника.Наименование;
		Попытка
			СоответствиеИмен.Вставить(ВРег(ЭлементСправочника.ИмяФайла), ЭлементСправочника.Ссылка);
		Исключение
			Renault_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		КонецПопытки;
		Индикатор.Значение = Индикатор.Значение + 1;
	КонецЦикла;

	Если ПроцессОбновления Тогда
		СоответствиеИменФайлов = Новый Соответствие;
		Для Каждого ИмяФайла Из СписокФайлов Цикл
			СоответствиеИменФайлов.Вставить(ВРег(ИмяФайла.Имя), ИмяФайла);
		КонецЦикла;
	КонецЕсли;

	Если Индикатор.МаксимальноеЗначение > 0 Тогда
		Индикатор.Закрыть();
	КонецЕсли;

	// Индикатор хода работы с ОО из каталога
	Индикатор.НаименованиеОбработкиДанных = ?(ПроцессОбновления, "Обновление ","Импортирование ") + "обработок обслуживания";
	Индикатор.КомментарийОбработкиДанных  = "";
	Индикатор.КомментарийЗначения         = "Обработано";
	Индикатор.МаксимальноеЗначение        = ?(ПроцессОбновления, ЭлементыСправочника.Количество(),СписокФайлов.Количество());
	Индикатор.Значение = 0;
	Если Индикатор.МаксимальноеЗначение > 0 Тогда
		Индикатор.Открыть();
	КонецЕсли;

	Если НЕ ПроцессОбновления Тогда
		Для Каждого ФайлОО Из СписокФайлов Цикл
			Индикатор.КомментарийОбработкиДанных = "Обработка файла: " + ФайлОО.Имя;
			Попытка
				ООИзФайла = ВнешниеОбработки.Создать(ФайлОО.ПолноеИмя);
				ОбрОбслуживания = ООИзФайла.ПолучитьФорму();
				ВерсияAPI = ?(ОбрОбслуживания.ПолучитьВерсиюAPI() <> 2.1, ОбрОбслуживания.ПолучитьВерсиюAPI(),2.01);
			Исключение
				Renault_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при обработке файла: " + ФайлОО.Имя + Символы.ПС
					    + "Файл не является обработкой обслуживания торгового оборудования" + Символы.ПС
					    + "или содержит ошибки, не позволяющие выполнить загрузку," + Символы.ПС
					    + "либо формат обработки не соответствует текущей версии системы 1С:Предприятие.", , , СтатусСообщения.Внимание);
				Индикатор.Значение = Индикатор.Значение + 1;
				Продолжить;
			КонецПопытки;

			Если ВерсияAPI >= ПолучитьСерверТО().ПолучитьВерсиюAPIКонфигурацииТО() Тогда // Версия API обработки не соответствует версии API конфигурации, то пропускаем файл
				ООИзСправочника = СоответствиеИмен.Получить(ВРег(ФайлОО.Имя));
				Если ООИзСправочника = Неопределено Тогда
					ОбъектСправочника = Справочники.Renault_ОбработкиОбслуживанияТО.СоздатьЭлемент();
					Попытка
						Если ОбъектСправочника.ПолучитьФорму().ЗагрузитьОбработкуОбслуживания(ФайлОО.ПолноеИмя) Тогда
							ОбъектСправочника.Записать();
							Сообщить("Элемент справочника """ + ОбъектСправочника.Наименование + """(" + ОбъектСправочника.Код + ") добавлен.", СтатусСообщения.Информация);
							ДобавленоЗаписей = ДобавленоЗаписей + 1;
						КонецЕсли;
					Исключение
						Renault_ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать элемент с кодом " + ОбъектСправочника.Код, , , СтатусСообщения.Внимание);
					КонецПопытки;
				Иначе
					ОбъектСправочника = ООИзСправочника.Ссылка.ПолучитьОбъект();
					ВерсияИзСпр = ОбъектСправочника.Версия;// Получение версии ОО в справочнике
					ВерсияИзФайла = ООИзФайла.ПолучитьФорму().ПолучитьОписание().ВерсияОбработки;// Получение версии ОО из файла

					Если ВерсияИзСпр < ВерсияИзФайла Тогда // Если версия ОО из файла равна или меньше версии в справочнике, то не обновляемся
						Попытка
							Если ОбъектСправочника.ПолучитьФорму().ЗагрузитьОбработкуОбслуживания(ФайлОО.ПолноеИмя) Тогда
								ОбъектСправочника.Записать();
								Сообщить("Элемент справочника """ + ОбъектСправочника.Наименование + """(" + ОбъектСправочника.Код + ") обновлен.", СтатусСообщения.Информация);
								ОбновленоЗаписей = ОбновленоЗаписей + 1;
							КонецЕсли;
						Исключение
							Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать элемент с кодом " + ОбъектСправочника.Код, , , СтатусСообщения.Внимание);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если НЕ ПроцессОбновления Тогда
					Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Файл " + ФайлОО.Имя + " не загружен." + Символы.ПС 
					    + "Версия API обработки (" + Формат(ВерсияAPI, "ЧДЦ=2; ЧН=Ноль") + ") меньше версии API конфигурации (" 
					    + Формат(ПолучитьСерверТО().ПолучитьВерсиюAPIКонфигурацииТО(), "ЧДЦ=2; ЧН=Ноль") + ").", , , СтатусСообщения.Внимание);
				КонецЕсли;
			КонецЕсли;
			Индикатор.Значение = Индикатор.Значение + 1;
		КонецЦикла;
	Иначе
		Для Каждого ООИзСправочника Из ЭлементыСправочника Цикл
			Индикатор.КомментарийОбработкиДанных = "Обработка элемента справочника: " + ООИзСправочника.Наименование;
			ФайлОО = СоответствиеИменФайлов.Получить(ВРег(ООИзСправочника.ИмяФайла));
			Если ФайлОО <> Неопределено Тогда
				Попытка
					ООИзФайла = ВнешниеОбработки.Создать(ФайлОО.ПолноеИмя);
					ОбрОбслуживания = ООИзФайла.ПолучитьФорму();
					ВерсияAPI = ?(ОбрОбслуживания.ПолучитьВерсиюAPI() <> 2.1, ОбрОбслуживания.ПолучитьВерсиюAPI(),2.01);
				Исключение
					Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при обработке файла: " + ФайлОО.Имя + Символы.ПС
						    + "Файл не является обработкой обслуживания торгового оборудования" + Символы.ПС
						    + "или содержит ошибки, не позволяющие выполнить загрузку," + Символы.ПС
						    + "либо формат обработки не соответствует текущей версии системы 1С:Предприятие.", , , СтатусСообщения.Внимание);
					Индикатор.Значение = Индикатор.Значение + 1;
					Продолжить;
				КонецПопытки;

				Если ВерсияAPI >= ПолучитьСерверТО().ПолучитьВерсиюAPIКонфигурацииТО() Тогда // Версия API обработки не соответствует версии API конфигурации, то пропускаем файл
					ОбъектСправочника = ООИзСправочника.Ссылка.ПолучитьОбъект();
					ВерсияИзСпр = ОбъектСправочника.Версия;// Получение версии ОО в справочнике
					ВерсияИзФайла = ООИзФайла.ПолучитьФорму().ПолучитьОписание().ВерсияОбработки;// Получение версии ОО из файла

					Если ВерсияИзСпр < ВерсияИзФайла Тогда // Если версия ОО из файла равна или меньше версии в справочнике, то не обновляемся
						Попытка
							Если ОбъектСправочника.ПолучитьФорму().ЗагрузитьОбработкуОбслуживания(ФайлОО.ПолноеИмя) Тогда
								ОбъектСправочника.Записать();
								Сообщить("Элемент справочника """ + ОбъектСправочника.Наименование + """(" + ОбъектСправочника.Код + ") обновлен.", СтатусСообщения.Информация);
								ОбновленоЗаписей = ОбновленоЗаписей + 1;
							КонецЕсли;
						Исключение
							Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать элемент с кодом " + ОбъектСправочника.Код, , , СтатусСообщения.Внимание);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Индикатор.Значение = Индикатор.Значение + 1;
		КонецЦикла;
	КонецЕсли;

	Если Индикатор.МаксимальноеЗначение > 0 Тогда
		Индикатор.Закрыть();
	КонецЕсли;

	УдалитьФайлы(Диалог.Каталог, "temp.epf");

	Сообщить("Процесс " + ?(ПроцессОбновления, "обновления", "загрузки") + " завершен." + Символы.ПС
	    + "Обработано файлов: " + ?(ПроцессОбновления, ЭлементыСправочника.Количество(),СписокФайлов.Количество()) + Символы.ПС + "Обновлено записей: " + Строка(ОбновленоЗаписей)
	    + ?(ПроцессОбновления, "", Строка(Символы.ПС + "Добавлено записей: " + ДобавленоЗаписей)) + Символы.ПС, СтатусСообщения.Информация);

КонецПроцедуры // ИмпортироватьОбработки()

// Процедура осуществляет экспорт обработок обслуживания.
//
// Параметры
//  ИспользоватьФильтр - <Булево>
//                     - В случае, если данный параметр имеет значение "Истина",
//                       будет использоваться фильтр.
//
&НаКлиенте
Процедура ЭкспортироватьОбработки(ВидТО = Неопределено) Экспорт

	УспешноОбработано = 0;
	ЭлементыСправочника = ПолучитьОбработки(ВидТО);
	Если ЭлементыСправочника.Количество() = 0 Тогда
		Предупреждение("Список экспортируемых обработок обслуживания пуст.");
		Возврат;
	КонецЕсли;

	Индикатор = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог, для сохранения обработок обслуживания";

	Пока Истина Цикл
		Если НЕ Диалог.Выбрать() Тогда // Выбирается каталог
			Возврат;
		КонецЕсли;

		// Проверка существования каталога на диске
		КаталогНаДиске = Новый Файл(Диалог.Каталог);
		Если НЕ КаталогНаДиске.Существует() Тогда
			Возврат;
		КонецЕсли;

		СписокФайлов = НайтиФайлы(Диалог.Каталог, "*.epf"); // Получаем список всех обработок в выбранном каталоге

		// Если в каталоге обнаружены обработки обслуживания
		Если СписокФайлов.Количество() <> 0 Тогда
			Ответ = Вопрос("В указанном каталоге обнаружены обработки обслуживания." 
			    + Символы.ПС + "Совпадающие обработки будут перезаписаны." 
			    + Символы.ПС + "Выбрать другой каталог?", РежимДиалогаВопрос.ДаНетОтмена);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Прервать;
			ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// Индикатор хода работы с ОО справочника
	Индикатор.НаименованиеОбработкиДанных = "Экспортирование обработок обслуживания";
	Индикатор.КомментарийОбработкиДанных  = "";
	Индикатор.КомментарийЗначения         = "Обработано";
	Индикатор.МаксимальноеЗначение        = ЭлементыСправочника.Количество();
	Индикатор.Значение = 0;
	Если Индикатор.МаксимальноеЗначение > 0 Тогда
		Индикатор.Открыть();
	КонецЕсли;

	// Выполняем обход справочника
	Обработка = Неопределено;
	Для Каждого ЭлементСправочника Из ЭлементыСправочника Цикл
		Индикатор.КомментарийОбработкиДанных = "Обработка элемента: " + ЭлементСправочника.Наименование;
		
		Попытка
			ИмяФайла = DMS_ПолучитьИмяФайла(Диалог.Каталог, ЭлементСправочника.ИмяФайла);

			ФайлНаДиске = Новый Файл(ИмяФайла);
			Если ФайлНаДиске.Существует() И ФайлНаДиске.ПолучитьТолькоЧтение() Тогда
				Ответ = Вопрос("Файл " + ЭлементСправочника.ИмяФайла + " имеет атрибут ""Только на чтение"". Перезаписать?", РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					ФайлНаДиске.УстановитьТолькоЧтение(Ложь);
					ЭлементСправочника.Обработка.Получить().Записать(ИмяФайла);
					ФайлНаДиске.УстановитьТолькоЧтение(Истина);

					Сообщить("Файл " + ЭлементСправочника.ИмяФайла + " сохранен.", СтатусСообщения.Информация);
					УспешноОбработано = УспешноОбработано + 1;
				Иначе
					Сообщить("Файл " + ЭлементСправочника.ИмяФайла + " имеет атрибут ""Только на чтение"".", СтатусСообщения.Внимание);
				КонецЕсли;
			Иначе
				ЭлементСправочника.Обработка.Получить().Записать(ИмяФайла);
				Сообщить("Файл " + ЭлементСправочника.ИмяФайла + ": сохранен.", СтатусСообщения.Информация);
				УспешноОбработано = УспешноОбработано + 1;
			КонецЕсли;
		Исключение
			Renault_Advanced_ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать " + ЭлементСправочника.ИмяФайла 
			    + Символы.ПС + "Проверьте свободное место на диске, а также, что диск не защищен от записи.", , , СтатусСообщения.Внимание);
		КонецПопытки;

		Индикатор.Значение = Индикатор.Значение + 1;
	КонецЦикла;

	Если Индикатор.МаксимальноеЗначение > 0 Тогда
		Индикатор.Закрыть();
	КонецЕсли;

	Сообщить("Процесс экспортирования завершен." + Символы.ПС + "Обработано записей: " + ЭлементыСправочника.Количество() 
	    + Символы.ПС + "Сохранено файлов: " + УспешноОбработано + Символы.ПС, СтатусСообщения.Информация);

КонецПроцедуры // ЭкспортироватьОбработки()

// Открывает помощника подключения и настройки торгового оборудования
//
Процедура ОткрытьПомощникПодключенияИНастройкиТО(ВидТО = Неопределено) Экспорт

	ФормаПомощника = Обработки.Renault_ТОНастройка.ПолучитьФорму("ФормаПомощникаНастроек");
	ФормаПомощника.мВидТОПоУмолчанию = ВидТО;
	ФормаПомощника.ОткрытьМодально();

КонецПроцедуры



// Функция формирует список значений по переданному массиву устройств.
//
// Параметры:
//  МассивУстройств - Массив устройств ТО.
//
// Возвращаемое значение:
//  СписокЗначений - сформированный список значений.
//
Функция ПолучитьСписокУстройствТОДляВыбора(МассивУстройств) Экспорт

	Перем ВидУстройства; // Хранит вид устройства
	Перем ПредставлениеУстройства; // Хранит представление устройства

	СписокУстройств = Новый СписокЗначений;

	Для Каждого Устройство Из МассивУстройств Цикл
		ПолучитьСерверТО().ПолучитьПредставлениеУстройства(Устройство, ВидУстройства, ПредставлениеУстройства);
		СписокУстройств.Добавить(Устройство, ПредставлениеУстройства);
	КонецЦикла;

	Возврат СписокУстройств;

КонецФункции // ПолучитьСписокУстройствДляВыбора()

//// Функция определяет и проверяет фискальный регистратор.
////
//// Параметры:
////  ФР - В эту переменную будет возвращен выбранный фискальный регистратор.
////
//// Возвращаемое значение:
////  Булево - Истина, если фискальный регистратор выбран.
////
//Функция ПолучитьПроверитьПараметрыДляПробитияЧека(ФР) Экспорт

//	ФР = ПолучитьЭлементТО(Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор,
//	   "Необходимо выбрать фискальный регистратор", "Фискальный регистратор не подключен!");

//	Возврат ЗначениеЗаполнено(ФР);

//КонецФункции // ПолучитьПроверитьПараметрыДляПробитияЧека()
// Функция определяет и проверяет фискальный регистратор.
//
// Параметры:
//  ФУ - В эту переменную будет возвращено выбранное фискальное устройство.
//
// Возвращаемое значение:
//  Булево - Истина, если фискальное устройство выбрано.
//
Функция ПолучитьПроверитьПараметрыДляПробитияЧека(ФУ, УчитыватьККТ = Ложь) Экспорт
	
	Если УчитыватьККТ = Истина Тогда
		МассивВидовТО = Новый Массив();
		МассивВидовТО.Добавить(Перечисления.Renault_ВидыТорговогоОборудования.ФискальныйРегистратор);
		МассивВидовТО.Добавить(Перечисления.Renault_ВидыТорговогоОборудования.ККТ);
		ФУ = ПолучитьЭлементТО(МассивВидовТО,
	   		"Необходимо выбрать фискальное устройство", "Фискальное устройство не подключено!");
	Иначе
		ФУ = ПолучитьЭлементТО(Перечисления.Renault_ВидыТорговогоОборудования.ФискальныйРегистратор,
	   		"Необходимо выбрать фискальный регистратор", "Фискальный регистратор не подключен!");
	КонецЕсли;

	Возврат ЗначениеЗаполнено(ФУ);

КонецФункции // ПолучитьПроверитьПараметрыДляПробитияЧека()


// Функция возвращает подключенный элемент ТО, вид которого передан параметром.
//
// Параметры:
//  ВидТО - вид торгового оборудования, подключенный элемент которого требуется получить.
//  ТекстЗаголовкаВыбора - текст заголовка для выбора.
//   Используется, когда подключено несколько элементов.
//  СообщениеНеПодключен - сообщение о том, что ни один элемент не подключен.
//
// Возвращаемое значение:
//  Нужный элемент торгового оборудования.
//
//Функция ПолучитьЭлементТО(ВидТО, ТекстЗаголовкаВыбора, СообщениеНеПодключен)

//	МассивТО = ПолучитьСерверТО().ПолучитьСписокУстройств(ВидТО);

//	Если МассивТО.Количество() = 0 Тогда
//		ЭлементТО = Неопределено;
//		Предупреждение(СообщениеНеПодключен);
//	ИначеЕсли МассивТО.Количество() = 1 Тогда
//		ЭлементТО = МассивТО[0];
//	Иначе
//		ЭлементТО = ПолучитьСписокУстройствТОДляВыбора(МассивТО).ВыбратьЭлемент(ТекстЗаголовкаВыбора);
//		Если ЭлементТО <> Неопределено Тогда
//			ЭлементТО = ЭлементТО.Значение;
//		КонецЕсли;
//	КонецЕсли;

//	Возврат ЭлементТО;

//КонецФункции // ПолучитьТО()

// Функция возвращает подключенный элемент ТО, вид которого передан параметром.
//
// Параметры:
//  ВидТО - список видов или вид торгового оборудования, подключенный элемент которого требуется получить.
//  ТекстЗаголовкаВыбора - текст заголовка для выбора.
//   Используется, когда подключено несколько элементов.
//  СообщениеНеПодключен - сообщение о том, что ни один элемент не подключен.
//
// Возвращаемое значение:
//  Нужный элемент торгового оборудования.
//
Функция ПолучитьЭлементТО(ВидТО, ТекстЗаголовкаВыбора, СообщениеНеПодключен)
	
	Если ТипЗнч(ВидТО) = Тип("Массив") И ВидТО.Количество() > 1 Тогда
		МассивТО = Новый Массив();
		Для Каждого Элемент Из ВидТО Цикл
			МассивПоВиду = ПолучитьСерверТО().ПолучитьСписокУстройств(Элемент);
			Renault_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТО, МассивПоВиду);
		КонецЦикла;
	Иначе
		МассивТО = ПолучитьСерверТО().ПолучитьСписокУстройств(ВидТО);
	КонецЕсли;

	Если МассивТО.Количество() = 0 Тогда
		ЭлементТО = Неопределено;
		Предупреждение(СообщениеНеПодключен);
	ИначеЕсли МассивТО.Количество() = 1 Тогда
		ЭлементТО = МассивТО[0];
	Иначе
		ЭлементТО = ПолучитьСписокУстройствТОДляВыбора(МассивТО).ВыбратьЭлемент(ТекстЗаголовкаВыбора);
		Если ЭлементТО <> Неопределено Тогда
			ЭлементТО = ЭлементТО.Значение;
		КонецЕсли;
	КонецЕсли;

	Возврат ЭлементТО;

КонецФункции // ПолучитьТО()



// Функция определяет и проверяет эквайринговую систему и фискальный регистратор.
//
// Параметры:
//  ЭС - В эту переменную будет возвращена выбранная эквайринговая система.
//  ФР - В эту переменную будет возвращен выбранный фискальный регистратор.
//
// Возвращаемое значение:
//  Булево - Истина, если эквайринговая система и фискальный регистратор выбраны.
//
Функция ПолучитьПроверитьПараметрыДляОплатыКартой(ЭС, ФР) Экспорт

	МассивВидовТО = Новый Массив();
	МассивВидовТО.Добавить(Перечисления.Renault_ВидыТорговогоОборудования.ФискальныйРегистратор);
	МассивВидовТО.Добавить(Перечисления.Renault_ВидыТорговогоОборудования.ККТ);

	
    ФР = ПолучитьЭлементТО(МассивВидовТО,
		"Необходимо выбрать фискальное устройство", "Фискальное устройство не подключено!");


	ЭС = ПолучитьЭлементТО(Перечисления.Renault_ВидыТорговогоОборудования.ЭквайринговаяСистема,
	   "Необходимо выбрать эквайринговую систему", "Эквайринговая система не подключена!");

	Возврат ЗначениеЗаполнено(ФР) И ЗначениеЗаполнено(ЭС);

КонецФункции // ПолучитьПроверитьПараметрыДляОплатыКартой()


//// Составляет полное имя файла из имени каталога и имени файла.
////
//// Параметры
////  ИмяКаталога  – Строка, содержащая путь к каталогу файла на диске.
////  ИмяФайла     – Строка, содержащая имя файла, без имени каталога.
////
//// Возвращаемое значение:
////   Строка – полное имя файла с учетом каталога.
////
//Функция ПолучитьИмяФайла(ИмяКаталога, ИмяФайла) 

//	Если Прав(ИмяКаталога, 1) = "\" Тогда
//		ИмяКаталога = Лев(ИмяКаталога, СтрДлина(ИмяКаталога) - 1);
//	КонецЕсли;

//	Возврат ИмяКаталога + ?(ПустаяСтрока(ИмяФайла), "", "\" + ИмяФайла);

//КонецФункции // ПолучитьИмяФайла()

// Функция возвращает каталог файла из полного имени файла
//
// Параметры
//  ПолноеИмяФайла  – Строка, Полное имя файла.
//
// Возвращаемое значение:
//   Строка   – имя файла.
//
Функция ПолучитьКаталогФайла(Знач ПолноеИмяФайла) 
	
	ИмяФайла = ПолучитьИмяФайлаИзПолногоИмени(ПолноеИмяФайла); 	
	ИмяКаталога = Лев(ПолноеИмяФайла,СтрДлина(ПолноеИмяФайла) - СтрДлина(ИмяФайла));
			
	Возврат ИмяКаталога;	
	
КонецФункции // рфПолучитьКаталогФайла()

// Функция возвращает имя файла из полного имени файла
//
// Параметры
//  ПолноеИмяФайла  – Строка, Полное имя файла.
//
// Возвращаемое значение:
//   Строка   – имя файла.
//
Функция ПолучитьИмяФайлаИзПолногоИмени(Знач ПолноеИмяФайла) 

	Пока Найти(ПолноеИмяФайла,"\")>0 Цикл
		ПолноеИмяФайла = Прав(ПолноеИмяФайла,СтрДлина(ПолноеИмяФайла) - Найти(ПолноеИмяФайла,"\"));
	КонецЦикла;	
	
	Возврат ПолноеИмяФайла;	
	
КонецФункции // рфПолучитьИмяФайлаИзПолногоИмени()
